Tekla.Structures.TeklaStructuresInternal.Filtering.BinaryFilterExpressionToken
This API supports the Open API infrastructure and is not intended to be used directly from your code. Use the Tekla.Structures.Filtering.Filter class instead.

Tekla.Structures.TeklaStructuresInternal.Filtering.BinaryFilterExpressionToken.FilterString
Gets or sets the FilterString string.

Tekla.Structures.TeklaStructuresInternal.Filtering.BinaryFilterExpressionToken.BinaryFilterOperatorType
Gets or sets the BinaryFilterOperatorType.

Tekla.Structures.TeklaStructuresInternal.Filtering.BinaryFilterExpressionToken.IsCollection
Gets or sets the IsCollection property.

Tekla.Structures.TeklaStructuresInternal.Filtering.BinaryFilterExpressionToken.Enabled
Gets or sets the Enabled property.

Tekla.Structures.TeklaStructuresInternal.Filtering.BinaryFilterExpressionToken.#ctor(System.String,Tekla.Structures.Filtering.BinaryFilterOperatorType,System.Boolean,System.Boolean)
Initializes a new instance of the BinaryFilterExpressionToken class.
FilterString: The FilterString property.
BinaryFilterOperatorType: The BinaryFilterOperator property.
IsCollection: True is a collection, otherwise false.
Enabled: True is enabled otherwise false.